anmh1205/AML_MicroMouse_2024/1. MicroMouse Code/2. MicroMouse - STM32F407VGT6/PCB_V1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void Move();

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUZZER_Pin GPIO_PIN_8
#define BUZZER_GPIO_Port GPIOD
#define STBY_Pin GPIO_PIN_12
#define STBY_GPIO_Port GPIOC
#define XSHUT_FF_Pin GPIO_PIN_0
#define XSHUT_FF_GPIO_Port GPIOD
#define BIN2_Pin GPIO_PIN_1
#define BIN2_GPIO_Port GPIOD
#define XSHUT_BR_Pin GPIO_PIN_2
#define XSHUT_BR_GPIO_Port GPIOD
#define BIN1_Pin GPIO_PIN_3
#define BIN1_GPIO_Port GPIOD
#define XSHUT_BL_Pin GPIO_PIN_4
#define XSHUT_BL_GPIO_Port GPIOD
#define AIN2_Pin GPIO_PIN_5
#define AIN2_GPIO_Port GPIOD
#define XSHUT_FR_Pin GPIO_PIN_6
#define XSHUT_FR_GPIO_Port GPIOD
#define AIN1_Pin GPIO_PIN_7
#define AIN1_GPIO_Port GPIOD
#define XSHUT_FL_Pin GPIO_PIN_3
#define XSHUT_FL_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
// Motor direction
#define FW 1
#define BW -1

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
